Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: What it means from the perspective of `quarkus-smallrye-jwt` which operates as part of the reactive Quarkus security architecture, is that an IO thread entering the link:https://github.com/smallrye/smallrye-jwt[SmallRye JWT] verification or decryption code might block in one of the following cases:
ja_jp: `quarkus-smallrye-jwt`がリアクティブなQuarkusセキュリティ・アーキテクチャの一部として動作する観点からこれが意味することは 、 link:https://github.com/smallrye/smallrye-jwt[SmallRye JWT] 検証または復号化コードに入るIOスレッドが、以下のいずれかのケースでブロックされる可能性があるということです：

source: What it means from the perspective of `quarkus-smallrye-jwt`, which operates as part of the reactive Quarkus security architecture, is that an IO thread entering the link:https://github.com/smallrye/smallrye-jwt[SmallRye JWT] verification or decryption code might block in one of the following cases:
ja_jp: `quarkus-smallrye-jwt`がリアクティブな Quarkus セキュリティーアーキテクチャーの一部として動作する観点からすると、link:https://github.com/smallrye/smallrye-jwt[SmallRye JWT] 検証または復号化コードに入る IO スレッドが、以下のいずれかのケースでブロックされる可能性があります。

source: What learning curve?
ja_jp: どんな学習曲線？

source: What makes a good Quarkus extension? What capabilities is a Quarkus extension expected to provide? Of course, it depends on the extension you are building. But, we found a set of attributes common to many extensions. This document explains what they are.
ja_jp: 優れた Quarkus エクステンションとはどのようなものでしょうか? Quarkus エクステンションにはどのような機能が必要でしょうか? もちろん、構築するエクステンションによって異なりますが、多くのエクステンションに共通する一連の属性があります。このドキュメントでは、それらの属性について説明します。

source: What makes a good Quarkus extension? What capabilities is a Quarkus extension expected to provide? Of course, it depends on the extension you are building. But, we found a set of attributes common to many extensions. This document explains what they are. We can arrange these charactertistics into a maturity matrix. Here's what the filled-in matrix might look like for a (made up) extension:
ja_jp: 優れた Quarkus エクステンションとはどのようなものでしょうか？ Quarkus エクステンションにはどのような機能が期待されるでしょうか？ もちろん、構築するエクステンションによって異なります。しかし、多くのエクステンションに共通する一連の属性が見つかりました。このドキュメントでは、それらが何であるかを説明します。これらの特性は、成熟度マトリックスとして整理できます。架空のエクステンションに対する、完成したマトリックスの例を以下に示します。

source: What metrics will be exposed? Only by adding the Micrometer extension, a lot of metrics are exposed by default for example metrics about the JVM engine like the number of current live threads `jvm_threads_live_threads` or metrics about the system itself like the current CPU usage `system_cpu_usage`. Additionally, more metrics will automatically be exposed depending on other Quarkus extensions we might be using. For example, if we are using a Quarkus REST extension such as Resteasy, it will automatically expose metrics about your running services:
ja_jp: どのようなメトリクスが公開されますか?Micrometerエクステンションを追加するだけで、多くのメトリクスがデフォルトで公開されます。例えば、現在のライブスレッド数のようなJVMエンジンに関するメトリクス `jvm_threads_live_threads` や、現在のCPU使用率のようなシステム自体に関するメトリクス `system_cpu_usage` などがあります。さらに、使用している他のQuarkusエクステンションに応じて、より多くのメトリクスが自動的に公開されます。例えば、ResteasyのようなQuarkusのRESTエクステンションを使用している場合、実行中のサービスに関するメトリクスが自動的に公開されます。

source: What other benefits are there?
ja_jp: 他にはどんなメリットがあるのでしょうか?

source: What scopes can I actually use in my Quarkus application?
ja_jp: 実際にQuarkusアプリケーションで使用できるスコープは何ですか?

source: What should I be careful of?
ja_jp: どんなことに気をつければいいのでしょうか?

source: What that means from a RESTEasy Reactive perspective
ja_jp: RESTEasy Reactive な視点から見た場合の意味

source: What the result type would be (see the `DisplayType` section below)
ja_jp: 結果のタイプ (以下の `DisplayType` セクションを参照)

source: What this configuration does is explained below, along with basic troubleshooting.
ja_jp: この設定で何ができるのか、基本的なトラブルシューティングも含めて説明します。

source: What this guide will focus on is the basics of how to use Hibernate with Panache, so let's start with how to create an entity:
ja_jp: このガイドでは、Hibernate with Panache の基本的な使用法に焦点を当てるので、まずエンティティの作成方法から始めましょう。

source: What to do when there is no initial offset in Kafka.Accepted values are earliest, latest and none Type: _string_
ja_jp: Kafka に初期オフセットがない場合の対処方法受け入れられる値は、earliest、latest、none Type: _string_

source: What version of Mandrel was used to generate a binary?
ja_jp: バイナリの生成に使用したMandrelのバージョンは？

source: What was described above is essentially the link:https://www.martinfowler.com/eaaCatalog/activeRecord.html[active record pattern], sometimes just called the entity pattern. Hibernate with Panache also allows for the use of the more classical link:https://martinfowler.com/eaaCatalog/repository.html[repository pattern] via `PanacheRepository`.
ja_jp: 上記で説明したのは、基本的に link:https://www.martinfowler.com/eaaCatalog/activeRecord.html[アクティブレコードパターン] であり、単にエンティティパターンと呼ばれることもあります。Hibernate with Panacheでは、 `PanacheRepository` を介して、より古典的な link:https://martinfowler.com/eaaCatalog/repository.html[リポジトリパターン] を使用することも可能です。

source: What we have just done is to create a Service Monitor named `prometheus-app-monitor` that will select apps with the label `app-with-metrics: quarkus-app` that was added in the previous step. Then, OpenShift will call the endpoint `/q/metrics` for all the services labeled with `app-with-metrics: quarkus-app` every 30 seconds.
ja_jp: 今行ったのは、前のステップで追加した `app-with-metrics: quarkus-app` というラベルのついたアプリを選択する `prometheus-app-monitor` という名前の Service Monitor を作成することです。すると、OpenShiftは30秒ごとに、 `app-with-metrics: quarkus-app` というラベルのついたサービスすべてについて、エンドポイント `/q/metrics` を呼び出します。

source: What we mean by "Supersonic Subatomic Java".
ja_jp: "Supersonic Subatomic Java"とはどういう意味ですか。

source: What we're doing in Panache allows you to write your Hibernate Reactive entities like this:
ja_jp: Panacheでは、HibernateのReactiveエンティティをこのように書けるようにしています:

source: What we're doing in Panache is allow you to write your Hibernate Reactive entities like this:
ja_jp: Panacheで行っているのは、HibernateのReactiveエンティティをこのように書くことができるようにすることです:

source: What we're doing in Panache is to allow you to write your Hibernate ORM entities like this:
ja_jp: Panacheでやっていることは、Hibernate ORMエンティティをこのように書けるようにすることです:

source: What would Quarkus' new link:/guides/aot[AOT packaging] do for startup times? (We're still working on that one, but I'm excited to see the answer.)
ja_jp: Quarkusの新しい link:/guides/aot[AOTパッケージング] は起動時間にどのような影響を与えるでしょうか？（これについてはまだ作業中ですが、その答えを見るのが楽しみです。）

source: What would be a Quarkus release without security improvements?
ja_jp: セキュリティの改善なしにQuarkusリリースがあるでしょうか？

source: What you will build
ja_jp: 何を構築するか

source: What you'll learn
ja_jp: 学習内容

source: What's A2A?
ja_jp: A2A とは？

source: What's Different from Jakarta EE Development
ja_jp: Jakarta EE 開発との違い

source: What's Next?
ja_jp: 次のステップ

source: What's Removed?
ja_jp: 何が削除されましたか?

source: What's also interesting is that Hibernate ORM collects metadata about its own annotations at runtime, both Hibernate-specific annotations and JPA annotations. And that's a lot of annotations, and a lot of metadata to process.
ja_jp: また興味深いのは、Hibernate ORM が実行時に、Hibernate 独自のアノテーションと JPA アノテーションの両方について、自身のメタデータを収集している点です。これは膨大な量のアノテーションであり、処理すべきメタデータも大量にあります。

source: What's important to notice is the periodic aspect of the commit. Offset commit is expensive, and to enhance performance, we should not commit the offset after each processed record. In this regard, Kafka behaves differently from traditional messaging solutions, such as JMS, which acknowledges each message individually. Another important characteristic is the positional aspect of the commit. You commit the position indicating that all the records located before that position are processed. But is it really the case?
ja_jp: 注目すべきは、コミットの周期的な側面です。オフセットコミットはコストがかかるので、パフォーマンスを向上させるためには、処理された各レコードの後にオフセットをコミットするべきではありません。この点で、Kafkaは、JMSのような従来のメッセージングソリューションとは異なる振る舞いをしており、各メッセージを個別に認識します。もう一つの重要な特徴は、コミットの位置的な側面です。位置をコミットすると、その位置より前にあるすべてのレコードが処理されることを示します。しかし、本当にそうなのでしょうか?

source: What's new
ja_jp: 変更点

source: What's new?
ja_jp: 変更点

source: What's next
ja_jp: 次のステップ

source: What's next for Leyden in Quarkus?
ja_jp: Quarkus における Leyden の次なる展開は？

source: What's next?
ja_jp: 次のステップ

source: What's the difference between a quickstart and a codestart?
ja_jp: クイックスタートとコードスタートの違いは何ですか?

source: What's the problem?
ja_jp: 課題

source: Whatever the approach is chosen, the profile can still be overridden with the `quarkus.profile` system property or the `QUARKUS_PROFILE` environment variable.
ja_jp: どのアプローチを選択しても、プロファイルは `quarkus.profile` システムプロパティーまたは `QUARKUS_PROFILE` 環境変数で引き続きオーバーライドすることができます。

source: What’s Actually Removed?
ja_jp: 実際に削除されるものは？

source: What’s Next for Adoptium
ja_jp: Adoptiumの次なる展開

source: What’s Next?
ja_jp: 次のステップ

source: What’s nice about Extension codestarts is that it’s useful for fresh Quarkus developers as well as experienced ones. This is because of the wide range (and growing) of Quarkus extensions, you simply can’t know them all.
ja_jp: Extension codestartsの良い点は、新しくQuarkusを開発したばかりの開発者だけでなく、経験豊富な開発者にも役立つ点です。これは、Quarkusのエクステンションの範囲が広い(そして増え続けている)ため、すべてを知っていることが単純に不可能だからです。

source: When <<testing-extensions,using `QuarkusUnitTest`>>, as an alternative to <<dump-the-generated-classes-to-the-file-system,setting `quarkus.debug.*-dir` manually>>, you may simply call `QuarkusUnitTest#debugBytecode`:
ja_jp: <<dump-the-generated-classes-to-the-file-system,setting `quarkus.debug.*-dir` manually>> を設定する代わりに、<<testing-extensions,using `QuarkusUnitTest`>> を使用する場合は、単に `QuarkusUnitTest#debugBytecode` を呼び出します。

source: When <<testing-extensions,using `QuarkusUnitTest`>>, if you need to enable trace logs for a particular test class, you may simply call `QuarkusUnitTest#traceCategories` and pass the logging categories in argument:
ja_jp: <<testing-extensions,using `QuarkusUnitTest`> を使用する場合、特定のテストクラスに対してトレースログを有効にする必要がある場合は、 単に `QuarkusUnitTest#traceCategories` を呼び出し、引数にロギングカテゴリーを渡します。

source: When AOT training is enabled, the flow is as follows:
ja_jp: AOT トレーニングが有効な場合、以下のフローになります。

source: When Compose Dev Service creates or discovers a project, regular dev service implementations create containers inside the compose project default network. This ensures that all services can communicate with each other using their service names as hostnames within the same network.
ja_jp: Compose Dev Service がプロジェクトを作成または検出すると、通常の dev service の実装は Compose プロジェクトのデフォルトネットワーク内にコンテナーを作成します。これにより、すべてのサービスが同じネットワーク内でサービス名をホスト名として使用して相互に通信できるようになります。

source: When I am comparing frameworks, I think that Doc is a very important factor, but I am also often pretty lazy when it comes to reading it... don't you?
ja_jp: フレームワークの比較をしていると、ドキュメントはとても重要な要素だと思うのですが、私もいざ読むとなるとかなり怠けてしまうとが多いです...あなたはどうですか?

source: When JFR starts recording an event, the event does not record to JFR yet, but when it commits that event, the event is recorded. Therefore, events that have started recording at dump time but have not yet been committed are not dumped. This is unavoidable due to the design of JFR. This means that events are not recorded forever if there are prolonged processing. Therefore, you will not be aware of prolonged processing.
ja_jp: JFR がイベントの記録を開始する場合、イベントはまだ JFR に記録されませんが、そのイベントをコミットすると記録されます。 したがって、ダンプ時に記録が開始されたがまだコミットされていないイベントはダンプされません。 これは JFR の設計上避けることができません。 つまり、処理が長時間にわたる場合でも、イベントが永続的に記録されるわけではありません。 したがって、処理が長時間かかることに気付くことはありません。

source: When Kafka broker receives a record, its acknowledgement can take time depending on the configuration. Also, it stores in-memory the records that cannot be written.
ja_jp: Kafka ブローカーがレコードを受信すると、設定に応じてその確認応答に時間がかかることがあります。また、書き込めないレコードをインメモリーに保存します。

source: When Quarkus OIDC works with the pure OAuth2 providers such as GitHub, it generates an internal ID token to represent the user authentication. The GitHub access token is still meant to access GitHub API.
ja_jp: Quarkus OIDC が GitHub のような純粋な OAuth2 プロバイダーと連携する場合、ユーザー認証を表すための内部 ID トークンを生成します。GitHub アクセストークンは依然として GitHub API にアクセスするためのものです。

source: When Quarkus Security rejects an authentication request, `HttpAuthenticationMechanism` returns an authentication challenge to the client. The type of challenge depends on the authentication mechanism. For example, with the OIDC OpenID Connect (OIDC) Authorization Code Flow mechanism, a redirect URL gets generated, and the client is returned to the OpenID Connect provider to authenticate.
ja_jp: Quarkus Securityが認証要求を拒否すると、 `HttpAuthenticationMechanism` はクライアントに認証チャレンジを返却します。 チャレンジのタイプは認証メカニズムによって異なります。 たとえば、OIDC OpenID Connect（OIDC）の認可コードフローメカニズムでは、リダイレクトURLが生成され、クライアントはOpenID Connectプロバイダに返されて認証されます。

source: When Quarkus applies modifications to artifacts resolved from Maven repositories, it can manifest these changes as pedigree notes in the generated SBOM. For example, if an application developer decided to remove certain classpath resources from a dependency, such as
ja_jp: Quarkus が Maven リポジトリーから解決されたアーティファクトに変更を適用した場合、生成された SBOM にこれらの変更を系譜ノートとして表示できます。 たとえばアプリケーション開発者が、以下のように依存関係から特定のクラスパスリソースを削除することにしたとします。

source: When Quarkus builds a gRPC Channel instance (the way gRPC clients communicate with gRPC services on a lower network level), users can apply their own Channel(Builder) customizers. The customizers are applied by `priority`, the higher the number the later customizer is applied. The customizers are applied before Quarkus applies user's client configuration; e.g. ideal for some initial defaults per all clients.
ja_jp: QuarkusがgRPCチャネルインスタンス（gRPCクライアントがより低いネットワークレベルでgRPCサービスと通信する方法）を構築する際、ユーザは独自のチャネル（ビルダー）カスタマイザを適用できます。 カスタマイザは `priority` によって適用され、数字が大きいほど後に適用されます。カスタマイザは、Quarkusがユーザーのクライアント設定を適用する前に適用されます。

source: When Quarkus builds a gRPC server instance, users can apply their own Server(Builder) customizers. The customizers are applied by `priority`, the higher the number the later customizer is applied. The customizers are applied before Quarkus applies user's server configuration; e.g. ideal for some initial defaults.
ja_jp: Quarkus が gRPC サーバーインスタンスを構築する際、ユーザーは独自の Server(Builder) カスタマイザーを適用できます。カスタマイザーは `priority` によって適用され、数字が大きいほど後に適用されます。カスタマイザーは、Quarkus がユーザーのサーバー設定を適用する前に適用されます。たとえば、いくつかの初期デフォルト設定に最適です。

source: When Quarkus fires the `HttpSecurity` CDI event, the runtime configuration is ready.
ja_jp: Quarkus が `HttpSecurity` CDI イベントを発生させると、ランタイム設定の準備が整います。

source: When Quarkus generates the Kubernetes metadata, it checks if the management interface is enabled and configures the probes accordingly. The resulting descriptor defines the main HTTP port (named `http`) and the management port (named `management`). Health probes (using HTTP actions) and Prometheus scrape URLs are configured using the `management` port.
ja_jp: Quarkus は Kubernetes のメタデータを生成する際に、マネジメントインタフェースが有効かどうかをチェックし、それに応じてプローブを設定します。結果の記述子は、メインの HTTP ポート (名前: `http`) とマネジメントポート (名前: `management`) を定義しています。Health プローブ (HTTP アクションを使用) とPrometheus スクレイプ URL は、`management` ポートを使用して設定されます。

source: When Quarkus invokes GraalVM `native-image` it will apply some additional flags by default.
ja_jp: QuarkusがGraalVM `native-image` を起動すると、 デフォルトでいくつかの追加フラグが適用されます。

source: When Quarkus is starting the `io.quarkus.deployment.builditem.LiveReloadBuildItem` is guaranteed to be present that gives information about this start, in particular:
ja_jp: Quarkusの起動時には、特にこの起動に関する情報を与える `io.quarkus.deployment.builditem.LiveReloadBuildItem` が存在することが保証されています。特に、

source: When Quarkus serves a HTTP endpoint, under the hood, there is a Vert.x HTTP server handling the request and response. That's also true for messaging, gRPC and almost any I/O.
ja_jp: QuarkusがHTTPエンドポイントを提供する場合、フードの下には、リクエストとレスポンスを処理するVert.x HTTPサーバーがあります。これは、メッセージング、gRPC、およびほぼすべてのI/Oにも当てはまります。

source: When Quarkus was designed, we didn’t focus only on containers but also on deploying Quarkus applications on container orchestrators such as Kubernetes. Quarkus build-time processing also generates the Kubernetes metadata, so your application is ready to be deployed on Kubernetes. Runtime capabilities such as health checks and metrics are exposed out of the box. Quarkus collects all the required metadata at build time to create the Kubernetes deployment descriptor and produce a container image. A single command line can deploy your application onto your Kubernetes cluster.
ja_jp: Quarkus の設計時には、コンテナーだけでなく、Kubernetes などのコンテナーオーケストレーター上への Quarkus アプリケーションのデプロイも考慮しました。Quarkus のビルド時処理は Kubernetes メタデータも生成するため、アプリケーションは Kubernetes にデプロイする準備が整います。ヘルスチェックやメトリクスなどの実行時機能は、すぐに利用できます。Quarkus は、ビルド時に必要なすべてのメタデータを収集し、Kubernetes のデプロイメント記述子を作成してコンテナーイメージを生成します。単一のコマンドラインで、アプリケーションを Kubernetes クラスターにデプロイできます。

source: When Quarkus was first released, the industry was focused on microservices. But Quarkus is just as well suited for large monoliths, whether you're modernizing existing systems or building new ones from scratch. In large applications, build times quickly become a bottleneck, and we've made significant improvements here. Let's discuss these!
ja_jp: Quarkusが最初にリリースされたとき、業界はマイクロサービスに焦点を当てていました。しかし、Quarkusは、既存のシステムを最新化する場合でも、新しいシステムをゼロから構築する場合でも、大規模なモノリスにも同様に適しています。大規模なアプリケーションでは、ビルド時間がすぐにボトルネックになるため、この点について大幅な改善を行いました。これらの改善点について説明しましょう！

source: When Quarkus will upgrade to Eclipse MicroProfile 6, the SmallRye Metrics support will be discontinued.
ja_jp: QuarkusがEclipse MicroProfile 6にアップグレードされると、SmallRye Metricsのサポートは打ち切られます。

source: When Quarkus will upgrade to Eclipse MicroProfile 6, the SmallRye OpenTracing support will be discontinued.
ja_jp: QuarkusがEclipse MicroProfile 6にアップグレードされると、SmallRye OpenTracingのサポートが停止されます。

source: When SSL/TLS is configured, `plain-text` is automatically disabled.
ja_jp: SSL/TLSを設定すると、 `plain-text` は自動的に無効になります。

source: When Section
ja_jp: セクションの際

source: When TLS is enabled, it covers both HTTP and gRPC traffic.
ja_jp: TLS が有効な場合、HTTP トラフィックと gRPC トラフィックの両方がカバーされます。

source: When To Use `@Named`?
ja_jp: `@Named` はいつ使用しますか？

source: When Undertow is present, RESTEasy functions as a Servlet filter. In its absence, RESTEasy operates directly on Vert.x without involving Servlets.
ja_jp: Undertowがある場合、RESTEasyはServletフィルタとして機能します。 Undertowがない場合、RESTEasyはServletを介さずにVert.x上で直接動作します。

source: When `@Blocking` is used, it ignores the `type` attribute of `@Route`.
ja_jp: `@Blocking` が使用されている場合、 `@Route` の `type` 属性は無視されます。

source: When `@Blocking` is used, the `type` attribute of the `@Route` is ignored.
ja_jp: `@Blocking` が使用される場合、 `@Route` の `type` 属性は無視されます。

source: When `@QuarkusIntegrationTest` results in launching a container (because the application was built with `quarkus.container-image.build` set to `true`), the container is launched on a predictable container network. This facilitates writing integration tests that need to launch services to support the application. This means that `@QuarkusIntegrationTest` works out of the box with containers launched via xref:dev-services.adoc[Dev Services], but it also means that it enables using <<quarkus-test-resource,QuarkusTestLifecycleManager>> resources that launch additional containers. This can be achieved by having your `QuarkusTestLifecycleManager` implement `io.quarkus.test.common.DevServicesContext.ContextAware`. A simple example could be the following:
ja_jp: `@QuarkusIntegrationTest` によってコンテナーが起動されると (`quarkus.container-image.build` が `true` に設定されているためにアプリケーションがビルドされたため)、コンテナーは予測可能なコンテナーネットワーク上で起動されます。これにより、アプリケーションをサポートするためにサービスを起動する必要があるインテグレーションテストの作成が容易になります。 これは、 `@QuarkusIntegrationTest` が、xref:dev-services.adoc[Dev Services] を介して起動されたコンテナーでそのまま機能することを意味しますが、追加のコンテナーを起動する <<quarkus-test-resource,QuarkusTestLifecycleManager>> リソースを使用して有効化することも意味します。 これは、 `QuarkusTestLifecycleManager` に `io.quarkus.test.common.DevServicesContext.ContextAware` を実装することで実現できます。以下は、その簡単な例です。

source: When `@QuarkusIntegrationTest` results in launching a container (because the application was built with `quarkus.container-image.build` set to `true`), the container is launched on a predictable container network. This facilitates writing integration tests that need to launch services to support the application. This means that `@QuarkusIntegrationTest` works out of the box with containers launched via xref:dev-services.adoc[Dev Services], but it also means that it enables using xref:quarkus-test-resource[QuarkusTestLifecycleManager] resources that launch additional containers. This can be achieved by having your `QuarkusTestLifecycleManager` implement `io.quarkus.test.common.DevServicesContext.ContextAware`. A simple example could be the following:
ja_jp: `@QuarkusIntegrationTest` によりコンテナが起動すると（アプリケーションが `quarkus.container-image.build` を `true` に設定してビルドされたため）、コンテナは予測可能なコンテナネットワークで起動されます。これにより、アプリケーションをサポートするサービスを起動する必要がある結合テストの記述が容易になります。つまり、 `@QuarkusIntegrationTest` は xref:dev-services.adoc[Dev Services] を介して起動したコンテナですぐに動作しますが、追加のコンテナを起動する xref:quarkus-test-resource[QuarkusTestLifecycleManager] リソースを使用することもできます。これは、 `QuarkusTestLifecycleManager` に `io.quarkus.test.common.DevServicesContext.ContextAware` を実装させることで実現できます。簡単な例として、次のようなものがあります:

source: When `SomeBusinessException` occurs, the error output will contain the Error code:
ja_jp: `SomeBusinessException` が発生した場合、エラー出力にはエラーコードが表示されます。

source: When `getWithOtherParam` is called, in addition to the `my-param` query parameter, `some-other-param` with the value of `other` will also be added.
ja_jp: `getWithOtherParam` を呼び出すと、クエリーパラメーター `my-param` に加え、 `some-other-param` に `other` の値が追加されます。

source: When `objcopy` is not available debug symbols are embedded in the executable.
ja_jp: `objcopy` が利用できない場合、デバッグシンボルが実行ファイルに埋め込まれています。

source: When `objcopy` is not available, debug symbols are embedded in the executable.
ja_jp: `objcopy` が利用できない場合、デバッグシンボルは実行ファイルに埋め込まれます。

source: When `partitions` is greater than 1, this attribute allows configuring how many records are requested by each consumer every time. Type: _int_
ja_jp: `partitions` が 1 より大きい場合、この属性を使用すると、各コンシューマーが毎回要求するレコードの数を設定できます。 Type: _int_

source: When `partitions` is greater than 1, this attribute allows configuring how many records are requested by each consumers every time. Type: _int_
ja_jp: `partitions` が 1 より大きい場合、この属性を使用すると、各コンシューマーが毎回要求するレコードの数を設定できます。 Type: _int_

source: When `quarkus.compose.devservices.start-services=false` is set, Compose Dev Services will only try to discover existing services with the determined project name, but won't start any new services, even if compose files are present.
ja_jp: `quarkus.compose.devservices.start-services=false` が設定されている場合、Compose Dev Services は、決定されたプロジェクト名で既存のサービスを検出を試みるだけで、Compose ファイルが存在しても新しいサービスは起動しません。

source: When `quarkus.compose.devservices.stop-services=false` is set, services will continue running after the application stops. This allows services to be reused by other applications or subsequent runs of the same application.
ja_jp: `quarkus.compose.devservices.stop-services=false` が設定されている場合、アプリケーションが停止した後もサービスは実行を継続します。これにより、サービスを他のアプリケーションや同じアプリケーションの後続の実行で再利用できます。

source: When `quarkus.tls.trust-all` is set to `true`, the trust store configuration is ignored. This is not recommended for production. Also, we recommend avoiding using `quarkus.tls.trust-all`, and use a named configuration instead if `trust-all` is required:
ja_jp: `quarkus.tls.trust-all` が `true` に設定されている場合、トラストストアの設定は無視されます。これは実稼働環境では推奨されません。 また `trust-all` が必要な場合は、 `quarkus.tls.trust-all` の使用は避け、代わりに名前付き設定を使用することが推奨されます。

source: When a JDBC extension - along with Agroal - and a reactive datasource extension handling the given database kind are included, they will both be created by default.
ja_jp: 指定された種類のデータベースを扱うJDBC エクステンション（およびAgroal）、そしてリアクティブデータソースエクステンションが含まれる場合、それらはデフォルトで作成されます。
